

magic = {
    "Свет": ["1.Вода", "2.Огонь", "3.Воздух", "4.Земля", "5.Пространство", "6.Время", "7.Призыв"],
    "Тьма": ["1.Вода", "2.Огонь", "3.Воздух", "4.Земля", "5.Пространство", "6.Время", "7.Призыв"],
    "Вода": ["1.Свет", "2.Тьма", "3.Воздух", "4.Земля", "5.Пространство", "6.Время", "7.Призыв"],
    "Огонь": ["1.Свет", "2.Тьма", "3.Воздух", "4.Земля", "5.Пространство", "6.Время", "7.Призыв"],
    "Воздух": ["1.Свет", "2.Тьма", "3.Вода", "4.Огонь", "5.Пространство", "6.Время", "7.Призыв"],
    "Земля": ["1.Свет", "2.Тьма", "3.Вода", "4.Огонь", "5.Пространство", "6.Время", "7.Призыв"],
    "Пространство": ["1.Свет", "2.Тьма", "3.Вода", "4.Огонь", "5.Воздух", "6.Земля"],
    "Время": ["1.Свет", "2.Тьма", "3.Вода", "4.Огонь", "5.Воздух", "6.Земля"],
    "Призыв": ["1.Свет", "2.Тьма", "3.Вода", "4.Огонь", "5.Воздух", "6.Земля"],
    }



def paladin(c):
    if c == 3:
        for idx, m in enumerate(magic, start=1):
            print(f'{idx}: {m}')

        PM = int(input("Выберите магию которой будет управлять ваш паладин:"))

        if PM == 1:
            cls = "Святой паладин"
        if PM == 2:
            cls = "Тёмный рыцарь"
        if PM == 3:
            cls = "Водный паладин"
        if PM == 4:
            cls = "Огненный паладин"
        if PM == 5:
            cls = "Воздушный паладин"
        if PM == 6:
            cls = "Земляной паладин"
        if PM == 7:
            cls = "Прастранственный паладин"
        if PM == 8:
            cls = "Паладин покоривший время"
        if PM == 9:
            cls = "Паладин призыва"
    return cls


def magicman(c):
    if c == 4:
        for idx, m in enumerate(magic, start=1):
            print(f"{idx}: {m}")
        MM = int(input("Выберите магию которой будет управлять ваш маг:"))
        a = int(input("Хотите сейчас выбрать вторую школу магии?   1.Да   2.Нет"))
        if a == 2:
            if MM == 1:
                cls = "Маг света"
            if MM == 2:
                cls = "Маг тьмы"
            if MM == 3:
                cls = "Маг воды"
            if MM == 4:
                cls = "Маг огня"
            if MM == 5:
                cls = "Маг воздуха"
            if MM == 6:
                cls = "Маг земли"
            if MM == 7:
                cls = "Маг пространство"
            if MM == 8:
                cls = "Маг времени"
            if MM == 9:
                cls = "Маг призыва"
        if a == 1:
            for idx, key in enumerate(magic):
                if MM-1 == idx:
                    print(key, magic[key])
                    MMC = int(input("Выберите вторую школу магии:"))
            if MM == 1:
                if MMC == 1:
                    cls = "Маг святой воды"
                if MMC == 2:
                    cls = "Маг святого огня"
                if MMC == 3:
                    cls = "Маг святого воздуха"
                if MMC == 4:
                    cls = "Маг святой земли"
                if MMC == 5:
                    cls = "Маг дневного перемещения"
                if MMC == 6:
                    cls = "Маг остановка светлого времени"
                if MMC == 7:
                    cls = "Маг воскрешения"
            if MM == 2:
                if MMC == 1:
                    cls = "Маг проклятой воды"
                if MMC == 2:
                    cls = "Маг проклятия огня"
                if MMC == 3:
                    cls = "Маг проклятого воздуха"
                if MMC == 4:
                    cls = "Маг проклятой земли"
                if MMC == 5:
                    cls = "Маг ночного"
                if MMC == 6:
                    cls = "Маг остановка тёмного времени"
                if MMC == 7:
                    cls = "Некромант"
            if MM == 3:
                if MMC == 1:
                    cls = "Маг воды света"
                if MMC == 2:
                    cls = "Маг воды проклятия"
                if MMC == 3:
                    a = int(input("Кого хотите выбрать?   1.Маг пара    2.Маг волн   3.Маг льда"))
                    if a == 1:
                        cls = "Маг пара"
                    elif a == 2:
                        cls = "Маг волн"
                    elif a == 3:
                        cls = "Маг льда"
                if MMC == 4:
                    cls = "Маг болот"
                if MMC == 5:
                    cls = "Маг водного перемещения"
                if MMC == 6:
                    cls = "Маг остановка водного времени"
                if MMC == 7:
                    cls = "Призватель водных сущевств"
            if MM == 4:
                if MMC == 1:
                    cls = "Маг праведного огня"
                if MMC == 2:
                    cls = "Маг проклятого огня"
                if MMC == 3:
                    cls = "Маг бушующего пламени"
                if MMC == 4:
                    cls = "Маг магмы"
                if MMC == 5:
                    cls = "Маг перемещения в огне"
                if MMC == 6:
                    cls = "Маг остановка огненного времени"
                if MMC == 7:
                    cls = "Призватель огненных сущевств"
            if MM == 5:
                if MMC == 1:
                    cls = "Маг воздуха света"
                if MMC == 2:
                    cls = "Маг воздуха проклятий"
                if MMC == 3:
                    cls = "Маг пара"
                if MMC == 4:
                    cls = "Маг обжигающего воздуха"
                if MMC == 5:
                    cls = "Маг перемещения на дальние расстояния"
                if MMC == 6:
                    cls = "Маг ваккума"
                if MMC == 7:
                    cls = "Призватель летающих сущевств"
            if MM == 6:
                if MMC == 1:
                    cls = "Маг святых земель"
                if MMC == 2:
                    cls = "Маг гиблых земель"
                if MMC == 3:
                    cls = "Глины"
                if MMC == 4:
                    cls = "Маг лавы"
                if MMC == 5:
                    cls = "Маг перемещения под землёй"
                if MMC == 6:
                    cls = "Маг упарвления временем земли"
                if MMC == 7:
                    cls = "Призватель подземных сущевств"
            if MM == 7:
                if MMC == 1:
                    cls = "Маг дневного перемещения"
                if MMC == 2:
                    cls = "Маг ночного перемещения"
                if MMC == 3:
                    cls = "Маг водного перемещения"
                if MMC == 4:
                    cls = "Маг перемещения в огне"
                if MMC == 5:
                    cls = "Маг перемещения на дальние расстояния"
                if MMC == 6:
                    cls = "Маг перемещения под землёй"
            if MM == 8:
                if MMC == 1:
                    cls = "Маг остановки светлого времени"
                if MMC == 2:
                    cls = "Маг остановки тёмного времени"
                if MMC == 3:
                    cls = "Маг остановки водного времени"
                if MMC == 4:
                    cls = "Маг остановки огненного времени"
                if MMC == 5:
                    cls = "Маг ваккума"
                if MMC == 6:
                    cls = "Маг управления времени земли"
            if MM == 9:
                if MMC == 1:
                    cls = "Маг воскрешения"
                if MMC == 2:
                    cls = "Некромант"
                if MMC == 3:
                    cls = "Призыватель водных сущевств"
                if MMC == 4:
                    cls = "Призыватель огненных сущевств"
                if MMC == 5:
                    cls = "Призыватель летающих сущевств"
                if MMC == 6:
                    cls = "Призыватель подземных сущевств"
        
        
        return cls
