
def racec():
    race = ["Бык", "Собака", "Дракон", "Змея", "Птица", "Рыба", "Лощадь", "Кошка"]
    subrace = ["Минотавр", "Кинокефал", "Драконит", "Нага", "Гарпия", "Русалка", "Кентавр", "Неко"]
    print("Изначально зверолюди подрузамевают смешения человека с животным, выберите с каким животным произойдёт смешение:")
    for idx, m in enumerate(race, start=1):
        print(f"{idx}: {m}")
    a = int(input())
    rr = subrace[a-1]
    return rr
def elfrace():
    a = int(input("1.Тёмный эльф       2.Светлый эльф"))
    if a == 1:
        rr = "Тёмный эльф"
    elif a == 2:
        rr = "Светлый эльф"
    return rr